## [13] Konversi Nilai Numerik ke Dalam Sejumlah Kategori

### [13.1] Import Module

In [3]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [13.2] Persiapan Data Frame
- membentuk data frame yang terdiri dari 10 baris dan 1 kolom 
- isi dari data frame adalah angka random yang dimulai dari 1 - 99

In [4]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99,size=(n_rows,n_cols)),columns=cols)
df

   usia
0    45
1    94
2     7
3    12
4    90
5    52
6     9
7    39
8    68
9    52

### [13.3] Pengelompokan Nilai Numerik ke Dalam Beberapa Kategori Menggunakan Cut ()
Mengelompokkan usia sesuai dengan jangkauan umur :
1. Anak dengan usia 0-18 tahun
2. Dewasa dengan usia 18-65 tahun
3. Manula dengan usia 65-99 tahun

In [5]:
df ['kelompok_usia'] =  pd.cut(df['usia'],
                              bins = [0,18,65,99],
                              labels = ['anak','dewasa','manula'])
df

   usia kelompok_usia
0    45        dewasa
1    94        manula
2     7          anak
3    12          anak
4    90        manula
5    52        dewasa
6     9          anak
7    39        dewasa
8    68        manula
9    52        dewasa